app/views/shelves/_form.html.erb

SELECT `genders`.* FROM `genders`
---
    <%= f.label :gender %><br>
    <%= f.select :gender_id, Gender.all.collect { |gender| [gender.name, gender.id] }, include_blank: true %>