app/views/movies/_form.html.erb

    <%= f.label :gender %><br>
    <%= f.select :gender_id, Gender.all.collect { |gender| [gender.name, gender.id] }, include_blank: true %>
---
SELECT `genders`.* FROM `genders`   ORDER BY `genders`.`name` ASC