app/views/rents/_form.html.erb

    <%= f.label :movies %><br>
    <!-- f.select :movie_ids, Movie.all.collect { |m| [m.title, m.id] }, {}, :multiple => true, :size => 5 -->
---
SELECT `movies`.* FROM `movies`

    <%= f.label :tenant %><br>
    <%= f.select :tenant_id, Tenant.all.collect { |t| [t.name, t.id] }, include_blank: true %>
---
SELECT `tenants`.* FROM `tenants`