app/views/rents/show.html.erb

  <strong>Movies:</strong>
  <%= @rent.movies.try(:map) { |m| m.title }.join(', ') %>
---
SELECT `movies`.* FROM `movies` INNER JOIN `movies_rents` ON `movies`.`id` = `movies_rents`.`movie_id` WHERE `movies_rents`.`rent_id` = 7