app/controllers/genders_controller.rb

  def index
    @genders = Gender.all
---
SELECT `genders`.* FROM `genders`

  def create
    @gender = Gender.new(gender_params)

    respond_to do |format|
      if @gender.save
---
INSERT INTO `genders` (`created_at`, `name`, `updated_at`) VALUES ('2014-10-28 16:06:28', 'Action', '2014-10-28 16:06:28')

    def set_gender
      @gender = Gender.find(params[:id])
---
SELECT  `genders`.* FROM `genders`  WHERE `genders`.`id` = 1 LIMIT 1