app/controllers/movies_controller.rb

SELECT `genders`.* FROM `genders`  WHERE `genders`.`id` IN (1)
SELECT `movies`.* FROM `movies`
---
  def index
    @movies = Movie.includes(:gender, :shelf)

INSERT INTO `movies` (`created_at`, `gender_id`, `review`, `shelf_id`, `title`, `updated_at`) VALUES ('2014-10-29 02:41:58', 1, 'rev', 1, 'Movie 2', '2014-10-29 02:41:58')
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE `movies` SET `gender_id` = 1, `review` = 'rev', `shelf_id` = 1, `title` = 'Movie 6', `updated_at` = '2014-10-29 22:26:48' WHERE `movies`.`id` = 6
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)

SELECT  `movies`.* FROM `movies`  WHERE `movies`.`id` = 1 LIMIT 1
---
    def set_movie
      @movie = Movie.find(params[:id])