app/controllers/rents_controller.rb

SELECT `movies`.* FROM `movies`  WHERE `movies`.`id` IN (3, 4, 5)
SELECT `rents`.* FROM `rents`
SELECT `tenants`.* FROM `tenants`  WHERE `tenants`.`id` IN (1, 3, 2)
---
  def index
    @rents = Rent.includes(:tenant, :movies)

INSERT INTO `rents` (`created_at`, `date`, `end_date`, `preview_date`, `price`, `tenant_id`, `updated_at`) VALUES ('2014-10-28 19:39:03', '2014-10-28 00:00:00', '2014-10-28 00:00:00', '2014-10-28 00:00:00', 12.0, 3, '2014-10-28 19:39:03')
---
  def create
    @rent = Rent.new(rent_params)
    @rent.date = DateTime.now

    respond_to do |format|
      if @rent.save

UPDATE `rents` SET `date` = '2014-10-30 00:00:00', `updated_at` = '2014-10-28 19:43:24' WHERE `rents`.`id` = 2
---
  def update
    respond_to do |format|
      if @rent.update(rent_params)

DELETE FROM `rents` WHERE `rents`.`id` = 1
---
  def destroy
    @rent.destroy

UPDATE `rents` SET `end_date` = '2014-11-03 00:24:36', `updated_at` = '2014-11-03 00:24:36' WHERE `rents`.`id` = 8
---
  def deliver
    @rent.end_date = DateTime.now
    @rent.save

SELECT  `rents`.* FROM `rents`  WHERE `rents`.`id` = 8 LIMIT 1
---
    def set_rent
      @rent = Rent.find(params[:id])

SELECT `movies`.* FROM `movies`  WHERE `movies`.`rented` IS NULL
SELECT `movies`.id FROM `movies` INNER JOIN `movies_rents` ON `movies`.`id` = `movies_rents`.`movie_id` WHERE `movies_rents`.`rent_id` = 5
---
    def set_movies
      @movies = Movie.where(rented: false)
      if not @rent.try(:movies).nil?
        @rent.try(:movies).each { |movie| @movies << movie if not @movies.include? movie }