app/controllers/tenants_controller.rb

SELECT `tenants`.* FROM `tenants`
---
  def index
    @tenants = Tenant.all

INSERT INTO `tenants` (`created_at`, `email`, `name`, `phone_number`, `updated_at`) VALUES ('2014-10-28 19:28:15', 'email', 'Cliente 1', 'asdhaksdhasdjkahdajks hadjsk sjdh ajksdhajk sdhakjh dkjas da', '2014-10-28 19:28:15')
---
  def create
    @tenant = Tenant.new(tenant_params)

    respond_to do |format|
      if @tenant.save

SELECT  `tenants`.* FROM `tenants`  WHERE `tenants`.`id` = 1 LIMIT 1
---
    def set_tenant
      @tenant = Tenant.find(params[:id])