app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `login`, `name`, `role`, `updated_at`) VALUES ('2014-10-28 16:41:36', 'andre.buarque90@gmail.com', 'andre buarque', 'role', '2014-10-28 16:41:36')
---
  def create
    @user = User.new(user_params)

    # Tell the UserMailer to send a welcome email after save
    UserMailer.welcome_email(@user).deliver if @user.valid?

    respond_to do |format|
      if @user.save